module Data =

let subjs = [("LP","Логическое программирование");("MTH","Математический анализ");("FP","Функциональное программирование");("INF","Информатика");("ENG","Английский язык");("PSY","Психология")]

let studs = 
 [
   (101,"Петров",[("LP",3);("MTH",3);("FP",4);("INF",4);("ENG",4);("PSY",2)]);
   (101,"Петровский",[("LP",4);("MTH",3);("FP",5);("INF",2);("ENG",5);("PSY",4)]);
   (103,"Иванов",[("LP",4);("MTH",5);("FP",5);("INF",4);("ENG",3);("PSY",3)]);
   (102,"Ивановский",[("LP",3);("MTH",4);("FP",4);("INF",3);("ENG",4);("PSY",4)]);
   (101,"Запорожцев",[("LP",4);("MTH",4);("FP",3);("INF",3);("ENG",2);("PSY",3)]);
   (104,"Сидоров",[("LP",3);("MTH",4);("FP",5);("INF",3);("ENG",3);("PSY",5)]);
   (101,"Сидоркин",[("LP",2);("MTH",4);("FP",5);("INF",4);("ENG",4);("PSY",2)]);
   (101,"Биткоинов",[("LP",4);("MTH",4);("FP",3);("INF",4);("ENG",2);("PSY",3)]);
   (103,"Эфиркина",[("LP",5);("MTH",3);("FP",3);("INF",3);("ENG",4);("PSY",4)]);
   (102,"Сиплюсплюсов",[("LP",4);("MTH",5);("FP",4);("INF",3);("ENG",4);("PSY",5)]);
   (104,"Программиро",[("LP",5);("MTH",3);("FP",3);("INF",4);("ENG",5);("PSY",3)]);
   (101,"Джаво",[("LP",4);("MTH",3);("FP",5);("INF",3);("ENG",4);("PSY",4)]);
   (103,"Клавиатурникова",[("LP",4);("MTH",5);("FP",2);("INF",3);("ENG",4);("PSY",5)]);
   (101,"Мышин",[("LP",3);("MTH",5);("FP",4);("INF",2);("ENG",3);("PSY",4)]);
   (103,"Фулл",[("LP",5);("MTH",5);("FP",5);("INF",3);("ENG",4);("PSY",3)]);
   (101,"Безумников",[("LP",3);("MTH",5);("FP",4);("INF",3);("ENG",4);("PSY",3)]);
   (101,"Шарпин",[("LP",5);("MTH",4);("FP",4);("INF",5);("ENG",5);("PSY",5)]);
   (103,"Круглосчиталкин",[("LP",4);("MTH",5);("FP",5);("INF",4);("ENG",5);("PSY",4)]);
   (101,"Решетников",[("LP",4);("MTH",4);("FP",3);("INF",4);("ENG",5);("PSY",4)]);
   (103,"Эксель",[("LP",2);("MTH",5);("FP",3);("INF",4);("ENG",4);("PSY",5)]);
   (101,"Текстописов",[("LP",3);("MTH",3);("FP",4);("INF",4);("ENG",5);("PSY",4)]);
   (101,"Текстописова",[("LP",3);("MTH",3);("FP",4);("INF",5);("ENG",4);("PSY",2)]);
   (101,"Густобуквенникова",[("LP",3);("MTH",4);("FP",2);("INF",5);("ENG",4);("PSY",4)]);
   (102,"Криптовалютников",[("LP",5);("MTH",3);("FP",5);("INF",4);("ENG",4);("PSY",2)]);
   (102,"Блокчейнис",[("LP",5);("MTH",4);("FP",5);("INF",5);("ENG",3);("PSY",4)]);
   (102,"Азурин",[("LP",2);("MTH",3);("FP",2);("INF",4);("ENG",4);("PSY",4)]);
   (104,"Вебсервисов",[("LP",3);("MTH",5);("FP",5);("INF",4);("ENG",4);("PSY",5)]);
   (103,"Круглотличников",[("LP",5);("MTH",4);("FP",5);("INF",3);("ENG",4);("PSY",4)])
 ]
