module Data =

let studs = 
 [
   (101,["Петров";"Петровский";"Запорожцев";"Сидоркин";"Биткоинов";"Джаво";"Мышин";"Безумников";"Шарпин";"Решетников";"Текстописов";"Текстописова";"Густобуквенникова"]);
   (102,["Ивановский";"Сиплюсплюсов";"Криптовалютников";"Блокчейнис";"Азурин"]);
   (103,["Иванов";"Эфиркина";"Клавиатурникова";"Фулл";"Круглосчиталкин";"Эксель";"Круглотличников"]);
   (104,["Сидоров";"Программиро";"Вебсервисов"])
 ]

let subjs = [("LP","Логическое программирование");("MTH","Математический анализ");("FP","Функциональное программирование");("INF","Информатика");("ENG","Английский язык");("PSY","Психология")]

let marks = 
 [
   ("LP",[(4,"Петров");(3,"Петровский");(3,"Иванов");(5,"Ивановский");(5,"Запорожцев");(4,"Сидоров");(2,"Сидоркин");(5,"Биткоинов");(4,"Эфиркина");(4,"Сиплюсплюсов");(4,"Программиро");(4,"Джаво");(4,"Клавиатурникова");(3,"Мышин");(2,"Фулл");(3,"Безумников");(5,"Шарпин");(4,"Круглосчиталкин");(2,"Решетников");(4,"Эксель");(4,"Текстописов");(3,"Текстописова");(4,"Густобуквенникова");(5,"Криптовалютников");(4,"Блокчейнис");(4,"Азурин");(5,"Вебсервисов");(3,"Круглотличников")]);
  ("MTH",[(4,"Петров");(5,"Петровский");(3,"Иванов");(5,"Ивановский");(3,"Запорожцев");(4,"Сидоров");(4,"Сидоркин");(5,"Биткоинов");(3,"Эфиркина");(3,"Сиплюсплюсов");(4,"Программиро");(4,"Джаво");(4,"Клавиатурникова");(4,"Мышин");(3,"Фулл");(4,"Безумников");(3,"Шарпин");(4,"Круглосчиталкин");(5,"Решетников");(3,"Эксель");(4,"Текстописов");(5,"Текстописова");(5,"Густобуквенникова");(4,"Криптовалютников");(3,"Блокчейнис");(4,"Азурин");(5,"Вебсервисов");(2,"Круглотличников")]);
  ("FP",[(4,"Петров");(4,"Петровский");(4,"Иванов");(4,"Ивановский");(4,"Запорожцев");(5,"Сидоров");(4,"Сидоркин");(4,"Биткоинов");(4,"Эфиркина");(5,"Сиплюсплюсов");(4,"Программиро");(2,"Джаво");(4,"Клавиатурникова");(3,"Мышин");(5,"Фулл");(4,"Безумников");(5,"Шарпин");(4,"Круглосчиталкин");(2,"Решетников");(2,"Эксель");(3,"Текстописов");(3,"Текстописова");(4,"Густобуквенникова");(2,"Криптовалютников");(4,"Блокчейнис");(4,"Азурин");(4,"Вебсервисов");(4,"Круглотличников")]);
  ("INF",[(5,"Петров");(4,"Петровский");(4,"Иванов");(4,"Ивановский");(4,"Запорожцев");(4,"Сидоров");(3,"Сидоркин");(5,"Биткоинов");(5,"Эфиркина");(2,"Сиплюсплюсов");(2,"Программиро");(4,"Джаво");(3,"Клавиатурникова");(4,"Мышин");(5,"Фулл");(4,"Безумников");(5,"Шарпин");(5,"Круглосчиталкин");(5,"Решетников");(4,"Эксель");(5,"Текстописов");(4,"Текстописова");(4,"Густобуквенникова");(5,"Криптовалютников");(4,"Блокчейнис");(5,"Азурин");(5,"Вебсервисов");(4,"Круглотличников")]);
  ("ENG",[(4,"Петров");(3,"Петровский");(5,"Иванов");(2,"Ивановский");(4,"Запорожцев");(5,"Сидоров");(5,"Сидоркин");(5,"Биткоинов");(3,"Эфиркина");(2,"Сиплюсплюсов");(4,"Программиро");(5,"Джаво");(5,"Клавиатурникова");(3,"Мышин");(4,"Фулл");(5,"Безумников");(3,"Шарпин");(4,"Круглосчиталкин");(5,"Решетников");(5,"Эксель");(3,"Текстописов");(4,"Текстописова");(3,"Густобуквенникова");(4,"Криптовалютников");(4,"Блокчейнис");(5,"Азурин");(5,"Вебсервисов");(4,"Круглотличников")]);
  ("PSY",[(5,"Петров");(4,"Петровский");(4,"Иванов");(5,"Ивановский");(5,"Запорожцев");(5,"Сидоров");(3,"Сидоркин");(4,"Биткоинов");(2,"Эфиркина");(2,"Сиплюсплюсов");(3,"Программиро");(3,"Джаво");(4,"Клавиатурникова");(2,"Мышин");(3,"Фулл");(5,"Безумников");(4,"Шарпин");(5,"Круглосчиталкин");(4,"Решетников");(4,"Эксель");(4,"Текстописов");(5,"Текстописова");(4,"Густобуквенникова");(3,"Криптовалютников");(5,"Блокчейнис");(5,"Азурин");(3,"Вебсервисов");(3,"Круглотличников")])
 ]
