CREATE TABLE Client (
    subscription_id serial NOT NULL,
    client_second_name varchar(50) NOT NULL,
    client_name varchar(50) NOT NULL,
    client_third_name varchar(50) NOT NULL,
    sex varchar(10) NOT NULL,
    birthdate DATE NOT NULL,
    height FLOAT NOT NULL,
    weight FLOAT NOT NULL,
    subscription_begin DATE NOT NULL,
    subscription_end DATE NOT NULL,
    CONSTRAINT Client_pk PRIMARY KEY (subscription_id)
);

CREATE TABLE Trainer (
    trainer_id serial NOT NULL,
    trainer_second_name varchar(50) NOT NULL,
    trainer_name varchar(50) NOT NULL,
    trainer_third_name varchar(50) NOT NULL,
    trainer_phone varchar(20) NOT NULL,
    CONSTRAINT Trainer_pk PRIMARY KEY (trainer_id)
);

CREATE TABLE Program (
    program_id serial NOT NULL,
    program_name varchar(50) NOT NULL,
    CONSTRAINT Program_pk PRIMARY KEY (program_id)
);

CREATE TABLE FC_Group (
    group_id serial NOT NULL,
    program_id integer NOT NULL,
    notes varchar(255) NOT NULL,
    trainer_id integer NOT NULL,
    clients_amount integer NOT NULL,
    CONSTRAINT Group_pk PRIMARY KEY (group_id)
);

CREATE TABLE Timetable (
    time_id integer NOT NULL UNIQUE,
    group_id integer NOT NULL
);

CREATE TABLE Group_client (
    group_id integer NOT NULL,
    subscription_id integer NOT NULL
);

CREATE TABLE Times (
    time_id serial NOT NULL,
    weekday varchar(20) NOT NULL,
    training_time TIME NOT NULL,
    program_id integer NOT NULL,
    CONSTRAINT Times_pk PRIMARY KEY (time_id)
);



ALTER TABLE Group_client
    ADD FOREIGN KEY (subscription_id)
        REFERENCES Client(subscription_id);

ALTER TABLE Group_client
    ADD FOREIGN KEY (Group_id)
        REFERENCES FC_Group(Group_id);

ALTER TABLE FC_Group
    ADD FOREIGN KEY (trainer_id)
        REFERENCES Trainer(trainer_id);

ALTER TABLE FC_Group
    ADD FOREIGN KEY (program_id)
        REFERENCES Program(program_id);

ALTER TABLE Times
    ADD FOREIGN KEY (program_id)
        REFERENCES Program(program_id);

ALTER TABLE Timetable
    ADD FOREIGN KEY (time_id)
        REFERENCES Times(time_id);

ALTER TABLE Timetable
    ADD FOREIGN KEY (Group_id)
        REFERENCES FC_Group(Group_id);



INSERT INTO client (client_second_name, client_name, client_third_name, sex, birthdate, height, weight, subscription_begin, subscription_end)
VALUES
    ('Битюкова', 'Моника', 'Борисовна', 'женский', '2001-01-12', 161, 50, '2022-03-30', '2022-09-30'),
    ('Бегова', 'Эрика', 'Коджаспировна', 'женский', '2000-04-28', 162, 53, '2022-04-30', '2022-08-30'),
    ('Бортаковская', 'Тина', 'Натальевна', 'женский', '2000-01-23', 163, 52, '2022-01-30', '2022-07-30'),
    ('Луйева', 'Рита', 'Беговна', 'женский', '2000-04-29', 170, 55, '2022-04-30', '2022-10-30'),
    ('Со', 'Сандра', 'Сергеевна', 'женский', '2000-05-30', 164, 51, '2022-05-30', '2022-12-30'),
    ('Карпова', 'Мэри', 'Андреевна', 'женский', '2000-01-18', 180, 60, '2022-04-30', '2022-10-30'),
    ('Лентяева', 'Джессика', 'Юрьевна', 'женский', '2000-03-14', 161, 50, '2022-05-30', '2022-12-30'),
    ('Альпова', 'Юлия', 'Юрьевна', 'женский', '2002-01-12', 163, 52, '2022-01-29', '2022-07-30'),
    ('Бальпова', 'Яна', 'Матвеевна', 'женский', '2003-04-28', 163, 53, '2022-04-29', '2022-08-30'),
    ('Куликова', 'Настя', 'Юрьевна', 'женский', '2004-01-23', 162, 59, '2022-03-29', '2022-09-30'),
    ('Суляева', 'Лина', 'Игоревна', 'женский', '2001-04-29', 161, 51, '2022-04-29', '2022-10-30'),
    ('Колмагорова', 'Наталья', 'Юрьевна', 'женский', '2001-03-30', 169, 54, '2022-05-29', '2022-12-30'),
    ('Красильникова', 'Дина', 'Альбертовна', 'женский', '1998-04-18', 180, 60, '2022-04-29', '2022-10-30'),
    ('Неспортивная', 'Анастасия', 'Махмудовна', 'женский', '2003-03-14', 160, 50, '2022-03-29', '2022-09-30'),
    ('Попов', 'Матвей', 'Романович', 'мужской', '2002-04-29', 183, 80, '2022-05-04', '2022-12-30'),
    ('Морозов', 'Артём', 'Борисович', 'мужской', '2002-04-29', 185, 150, '2022-05-11', '2022-12-30'),
    ('Фаттяхетдинов', 'Сильвестр', 'Динарович', 'мужской', '2002-04-29', 192, 75, '2022-05-12', '2022-12-30'),
    ('Борисов', 'Ян', 'Артурович', 'мужской', '2002-04-29', 170, 60, '2022-05-13', '2022-12-30'),
    ('Шандрюк', 'Пётр', 'Николаевич', 'мужской', '2002-04-28', 214, 90, '2022-05-30', '2022-12-30'),
    ('Молчанов', 'Владислав', 'Дмитриевич', 'мужской', '2002-01-18', 180, 80, '2022-05-14', '2022-12-30'),
    ('Котов', 'Дмитрий', 'Валерьевич', 'женский', '2002-08-14', 180, 70, '2022-05-30', '2022-12-30'),
    ('Битюков', 'Юрий', 'Иванович', 'мужской', '2002-04-29', 183, 80, '2021-05-04', '2022-12-30'),
    ('Квашнин', 'Сергей', 'Павлович', 'мужской', '2002-04-29', 185, 150, '2021-05-11', '2022-12-30'),
    ('Баранов', 'Алексей', 'Отчествович', 'мужской', '2002-04-29', 192, 75, '2021-05-12', '2022-12-30'),
    ('Нефор', 'Китошка', 'Базович', 'мужской', '2002-04-29', 170, 60, '2021-05-13', '2022-12-30'),
    ('Черепанов', 'Вениамин', 'Валерьевич', 'мужской', '2002-04-28', 214, 90, '2022-03-30', '2022-09-30'),
    ('Полонский', 'Кирилл', 'Паукович', 'мужской', '2002-01-18', 180, 80, '2021-03-30', '2021-09-30'),
    ('Алапанов', 'Эльзий', 'Владиславович', 'мужской', '2002-08-14', 180, 70, '2022-05-14', '2022-12-30'),
    ('Ципенко', 'Антон', 'Павлович', 'мужской', '2000-01-18', 180, 90, '2022-03-30', '2022-09-30'),
    ('Ларина', 'Елена', 'Владимировна', 'женский', '2000-03-14', 170, 65, '2022-03-30', '2022-09-30');



INSERT INTO Trainer (trainer_second_name, trainer_name, trainer_third_name, trainer_phone)
VALUES
    ('Коджаспиров', 'Юрий', 'Георгиевич', '+79539421212'),
    ('Горбунов', 'Аркадий', 'Вячеславович', '+79321234431'),
    ('Житняков', 'Михаил', 'Васильевич', '+79121212211'),
    ('Афанасьев', 'Пётр', 'Иванович', '+79321213344'),
    ('Петров', 'Иван', 'Артёмович', '+79231213455'),
    ('Серебренников', 'Михаил', 'Петрович', '+79208881122'),
    ('Артёмов', 'Иван', 'Иванович', '+79134441212'),
    ('Иванов', 'Юрий', 'Артёмович', '+79201112324'),
    ('Трофимов', 'Валерий', 'Иванович', '+79204431243'),
    ('Павликов', 'Никита', 'Петрович', '+79120442312');



INSERT INTO Program (program_name)
VALUES
    ('Танцы'),
    ('Тяжёлая атлетика'),
    ('Кроссфит'),
    ('Бассеин'),
    ('Кардиотренировка'),
    ('Боевые искусства'),
    ('Игровые программы'),
    ('Детский фитнес');



INSERT INTO Times (weekday, training_time, program_id)
VALUES
    ('Понедельник', '16:30', 1),
    ('Понедельник', '18:15', 1),
    ('Понедельник', '20:00', 1),
    ('Вторник', '16:30', 1),
    ('Вторник', '18:15', 1),
    ('Вторник', '20:00', 1),
    ('Среда', '16:30', 1),
    ('Среда', '18:15', 1),
    ('Среда', '20:00', 1),
    ('Четверг', '16:30', 1),
    ('Четверг', '18:15', 1),
    ('Четверг', '20:00', 1),
    ('Пятница', '16:30', 1),
    ('Пятница', '18:15', 1),
    ('Пятница', '20:00', 1),
    ('Суббота', '13:00', 1),
    ('Суббота', '14:45', 1),
    ('Суббота', '16:30', 1),
    ('Суббота', '18:15', 1),
    ('Воскресенье', '13:00', 1),
    ('Воскресенье', '14:45', 1),
    ('Воскресенье', '16:30', 1),
    ('Воскресенье', '18:15', 1),
    ('Понедельник', '16:30', 2),
    ('Понедельник', '18:15', 2),
    ('Понедельник', '20:00', 2),
    ('Вторник', '16:30', 2),
    ('Вторник', '18:15', 2),
    ('Вторник', '20:00', 2),
    ('Среда', '16:30', 2),
    ('Среда', '18:15', 2),
    ('Среда', '20:00', 2),
    ('Четверг', '16:30', 2),
    ('Четверг', '18:15', 2),
    ('Четверг', '20:00', 2),
    ('Пятница', '16:30', 2),
    ('Пятница', '18:15', 2),
    ('Пятница', '20:00', 2),
    ('Суббота', '13:00', 2),
    ('Суббота', '14:45', 2),
    ('Суббота', '16:30', 2),
    ('Суббота', '18:15', 2),
    ('Воскресенье', '13:00', 2),
    ('Воскресенье', '14:45', 2),
    ('Воскресенье', '16:30', 2),
    ('Воскресенье', '18:15', 2),
    ('Понедельник', '16:30', 3),
    ('Понедельник', '18:15', 3),
    ('Понедельник', '20:00', 3),
    ('Вторник', '16:30', 3),
    ('Вторник', '18:15', 3),
    ('Вторник', '20:00', 3),
    ('Среда', '16:30', 3),
    ('Среда', '18:15', 3),
    ('Среда', '20:00', 3),
    ('Четверг', '16:30', 3),
    ('Четверг', '18:15', 3),
    ('Четверг', '20:00', 3),
    ('Пятница', '16:30', 3),
    ('Пятница', '18:15', 3),
    ('Пятница', '20:00', 3),
    ('Суббота', '13:00', 3),
    ('Суббота', '14:45', 3),
    ('Суббота', '16:30', 3),
    ('Суббота', '18:15', 3),
    ('Воскресенье', '13:00', 3),
    ('Воскресенье', '14:45', 3),
    ('Воскресенье', '16:30', 3),
    ('Воскресенье', '18:15', 3),
    ('Понедельник', '16:30', 4),
    ('Понедельник', '18:15', 4),
    ('Понедельник', '20:00', 4),
    ('Вторник', '16:30', 4),
    ('Вторник', '18:15', 4),
    ('Вторник', '20:00', 4),
    ('Среда', '16:30', 4),
    ('Среда', '18:15', 4),
    ('Среда', '20:00', 4),
    ('Четверг', '16:30', 4),
    ('Четверг', '18:15', 4),
    ('Четверг', '20:00', 4),
    ('Пятница', '16:30', 4),
    ('Пятница', '18:15', 4),
    ('Пятница', '20:00', 4),
    ('Суббота', '13:00', 4),
    ('Суббота', '14:45', 4),
    ('Суббота', '16:30', 4),
    ('Суббота', '18:15', 4),
    ('Воскресенье', '13:00', 4),
    ('Воскресенье', '14:45', 4),
    ('Воскресенье', '16:30', 4),
    ('Воскресенье', '18:15', 4),
    ('Понедельник', '16:30', 5),
    ('Понедельник', '18:15', 5),
    ('Понедельник', '20:00', 5),
    ('Вторник', '16:30', 5),
    ('Вторник', '18:15', 5),
    ('Вторник', '20:00', 5),
    ('Среда', '16:30', 5),
    ('Среда', '18:15', 5),
    ('Среда', '20:00', 5),
    ('Четверг', '16:30', 5),
    ('Четверг', '18:15', 5),
    ('Четверг', '20:00', 5),
    ('Пятница', '16:30', 5),
    ('Пятница', '18:15', 5),
    ('Пятница', '20:00', 5),
    ('Суббота', '13:00', 5),
    ('Суббота', '14:45', 5),
    ('Суббота', '16:30', 5),
    ('Суббота', '18:15', 5),
    ('Воскресенье', '13:00', 5),
    ('Воскресенье', '14:45', 5),
    ('Воскресенье', '16:30', 5),
    ('Воскресенье', '18:15', 5),
    ('Понедельник', '16:30', 6),
    ('Понедельник', '18:15', 6),
    ('Понедельник', '20:00', 6),
    ('Вторник', '16:30', 6),
    ('Вторник', '18:15', 6),
    ('Вторник', '20:00', 6),
    ('Среда', '16:30', 6),
    ('Среда', '18:15', 6),
    ('Среда', '20:00', 6),
    ('Четверг', '16:30', 6),
    ('Четверг', '18:15', 6),
    ('Четверг', '20:00', 6),
    ('Пятница', '16:30', 6),
    ('Пятница', '18:15', 6),
    ('Пятница', '20:00', 6),
    ('Суббота', '13:00', 6),
    ('Суббота', '14:45', 6),
    ('Суббота', '16:30', 6),
    ('Суббота', '18:15', 6),
    ('Воскресенье', '13:00', 6),
    ('Воскресенье', '14:45', 6),
    ('Воскресенье', '16:30', 6),
    ('Воскресенье', '18:15', 6),
    ('Понедельник', '16:30', 7),
    ('Понедельник', '18:15', 7),
    ('Понедельник', '20:00', 7),
    ('Вторник', '16:30', 7),
    ('Вторник', '18:15', 7),
    ('Вторник', '20:00', 7),
    ('Среда', '16:30', 7),
    ('Среда', '18:15', 7),
    ('Среда', '20:00', 7),
    ('Четверг', '16:30', 7),
    ('Четверг', '18:15', 7),
    ('Четверг', '20:00', 7),
    ('Пятница', '16:30', 7),
    ('Пятница', '18:15', 7),
    ('Пятница', '20:00', 7),
    ('Суббота', '13:00', 7),
    ('Суббота', '14:45', 7),
    ('Суббота', '16:30', 7),
    ('Суббота', '18:15', 7),
    ('Воскресенье', '13:00', 7),
    ('Воскресенье', '14:45', 7),
    ('Воскресенье', '16:30', 7),
    ('Воскресенье', '18:15', 7),
    ('Понедельник', '16:30', 8),
    ('Понедельник', '18:15', 8),
    ('Понедельник', '20:00', 8),
    ('Вторник', '16:30', 8),
    ('Вторник', '18:15', 8),
    ('Вторник', '20:00', 8),
    ('Среда', '16:30', 8),
    ('Среда', '18:15', 8),
    ('Среда', '20:00', 8),
    ('Четверг', '16:30', 8),
    ('Четверг', '18:15', 8),
    ('Четверг', '20:00', 8),
    ('Пятница', '16:30', 8),
    ('Пятница', '18:15', 8),
    ('Пятница', '20:00', 8),
    ('Суббота', '13:00', 8),
    ('Суббота', '14:45', 8),
    ('Суббота', '16:30', 8),
    ('Суббота', '18:15', 8),
    ('Воскресенье', '13:00', 8),
    ('Воскресенье', '14:45', 8),
    ('Воскресенье', '16:30', 8),
    ('Воскресенье', '18:15', 8);



INSERT INTO fc_group (program_id, notes, trainer_id, clients_amount)
VALUES
    (1, '', 1, 8),
    (2, '', 3, 6),
    (3, '', 4, 7),
    (4, '', 5, 8),
    (5, '', 6, 6),
    (6, '', 2, 8),
    (7, '', 7, 12),
    (8, '', 8, 10),
    (2, '', 9, 6),
    (5, '', 10, 6);



INSERT INTO group_client (group_id, subscription_id)
VALUES
    (1, 1),
    (1, 2),
    (1, 3),
    (1, 4),
    (1, 5),
    (1, 6),
    (1, 7),
    (2, 25),
    (2, 26),
    (2, 27),
    (2, 28),
    (2, 29),
    (2, 30),
    (3, 19),
    (3, 20),
    (3, 21),
    (3, 22),
    (3, 23),
    (4, 1),
    (4, 2),
    (4, 3),
    (4, 4),
    (4, 5),
    (4, 6),
    (4, 7),
    (5, 8),
    (5, 12),
    (5, 13),
    (5, 14),
    (6, 15),
    (6, 16),
    (6, 17),
    (6, 10),
    (6, 11),
    (7, 9),
    (7, 16),
    (7, 17),
    (7, 18),
    (7, 19),
    (7, 21),
    (7, 25),
    (7, 8),
    (7, 7),
    (7, 22),
    (8, 23),
    (8, 24),
    (8, 17),
    (8, 21),
    (8, 28),
    (8, 14),
    (8, 9),
    (8, 10),
    (9, 1),
    (9, 2),
    (9, 3),
    (9, 4),
    (9, 5),
    (10, 15),
    (10, 16),
    (10, 17),
    (10, 18),
    (10, 19);



INSERT INTO timetable (time_id, group_id)
VALUES
    (8, 1),
    (12, 1),
    (15, 1),
    (24, 2),
    (27, 2),
    (30, 2),
    (54, 3),
    (58, 3),
    (64, 3),
    (71, 4),
    (74, 4),
    (86, 4),
    (92, 4),
    (93, 5),
    (97, 5),
    (101, 5),
    (123, 6),
    (125, 6),
    (128, 6),
    (149, 7),
    (152, 7),
    (154, 7),
    (158, 7),
    (163, 8),
    (165, 8),
    (168, 8),
    (171, 8),
    (33, 9),
    (37, 9),
    (40, 9),
    (104, 10),
    (105, 10),
    (111, 10);
