INSERT INTO "leads" (ad_id, title, description, price, status, responsible, company_id, client_company, client_employee, creation_date, is_deleted)
VALUES
    (1, 'Облачное хранилище для компании «Банкет»', 'Заказывают 200 ТБ', 2000, 4, 9, 3, 2, 6, '2023-05-05', false),
    (2, 'Перевозка оборудования для компании «Банкет»', 'Мебель, интерьер, около 200 кг', 30000, 3, 1, 1, 2, 7, '2023-06-06', false),
    (2, 'Перевозка кабелей и оборудования для коммутации', 'Около 150 кг', 19000, 5, 2, 1, 3, 10, '2023-07-07', false),
    (1, 'Облачное хранилище для компании «Банкет»', '10 ТБ, 1 год', 42000, 6, 9, 3, 1, 5, '2023-08-08', false),
    (3, 'Перевозка сервера для компании «Банкет»', 'Жёсткие диски, серверное оборудование', 100000, 2, 4, 1, 2, 7, '2023-09-09', false),
    (4, 'Деловая встреча компании «Драйв»', 'Банкет на 90 человек', 500000, 5, 8, 2, 1, 1, '2023-10-10', false);
